Autodesk.Revit.DB.Architecture.TreadNosingPosition
Represents on which edges of the nosing to apply the nosing profile.
Since:
2013

Autodesk.Revit.DB.Architecture.TreadNosingPosition.FrontLeftAndRight
Adds nosing on the front left and left edge of tread.

Autodesk.Revit.DB.Architecture.TreadNosingPosition.FrontAndRight
Adds nosing on the front and right edge of tread.

Autodesk.Revit.DB.Architecture.TreadNosingPosition.FrontAndLeft
Adds nosing on the front and left edge of tread.

Autodesk.Revit.DB.Architecture.TreadNosingPosition.FrontOnly
Adds nosing on the front edge of tread only.